# SE-YOLO: 面向钢材缺陷检测的轻量级检测器
# 基于 YOLOv8n 架构, 集成 SCA-Block + C2f_GSC_Cross + PGI_Detect
#
# 使用方式:
#   from ultralytics import YOLO
#   model = YOLO("ultra-mod/cfg/models/se-yolo.yaml")
#   model.train(data="NEU-DET/data.yaml", epochs=300)
#
# 注意: 需在 ultralytics/nn/tasks.py 中注册自定义模块:
#   from ultra_mod.nn.modules.spd_conv import SCABlock
#   from ultra_mod.nn.modules.gsconv import C2f_GSC_Cross
#   from ultra_mod.nn.modules.head import PGI_Detect

# 参数
nc: 6  # NEU-DET 类别数: crazing, inclusion, patches, pitted_surface, rolled-in_scale, scratches
scales:
  # [depth, width, max_channels] 使用 n (nano) 尺度
  n: [0.33, 0.25, 1024]

# ────────────────────────────────────────────────────────────
# Backbone: SCA-Block 替换 stride=2 卷积, 无损下采样
# ────────────────────────────────────────────────────────────
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]        # 0-P1/2   (640→320)  stem
  - [-1, 1, Conv, [128, 3, 2]]       # 1-P2/4   (320→160)  常规下采样
  - [-1, 3, C2f, [128, True]]        # 2        特征提取

  # SCA-Block 代替 stride=2 Conv:  SPD+CA 融合无损下采样
  - [-1, 1, SCABlock, [256]]          # 3-P3/8   (160→80)   创新1: 无损下采样
  - [-1, 6, C2f, [256, True]]        # 4        特征提取

  - [-1, 1, SCABlock, [512]]          # 5-P4/16  (80→40)
  - [-1, 6, C2f, [512, True]]        # 6

  - [-1, 1, SCABlock, [512]]          # 7-P5/32  (40→20)
  - [-1, 3, C2f, [512, True]]        # 8

  - [-1, 1, SPPF, [512, 5]]           # 9-P5/32  SPPF

# ────────────────────────────────────────────────────────────
# Neck: C2f_GSC_Cross 替换 C2f, GSConv 轻量化特征融合
# ────────────────────────────────────────────────────────────
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 10 上采样 P5→P4
  - [[-1, 6], 1, Concat, [1]]                     # 11 拼接 P4 特征
  - [-1, 3, C2f_GSC_Cross, [512, False]]           # 12 创新2: GSConv 特征融合

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 13 上采样→P3
  - [[-1, 4], 1, Concat, [1]]                     # 14 拼接 P3 特征
  - [-1, 3, C2f_GSC_Cross, [256, False]]           # 15 创新2: GSConv 特征融合

  # P2 辅助分支 (仅训练, 推理时 PGI_Detect 自动剥离)
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 16 上采样 P3→P2
  - [[-1, 2], 1, Concat, [1]]                     # 17 拼接 P2 特征
  - [-1, 3, C2f_GSC_Cross, [128, False]]           # 18 创新2: P2 轻量化融合

  # 检测头 (Detect + P2 辅助分支)
  # 输入: [P3(层15), P4(层12), P5(层9), P2(层18)]
  # 训练: 主分支(P3/P4/P5) + 辅助分支(P2) 联合 Loss
  # 推理: 仅主分支, P2 自动剥离 → 零额外算力
  - [[15, 12, 9, 18], 1, PGI_Detect, [nc]]        # 19 创新3: PGI 检测头
